[
    {
      "riddle": "I am a ghost who sets the story in motion, urging my son to remember and seek revenge. Who am I?",
      "hint": "I come from beyond the grave to stir the living.",
      "answer": "King Hamlet's ghost",
      "difficulty": 2
    },
    {
      "riddle": "I am the friend who swears to keep Hamlet’s secrets, and I see the ghost, too. Who am I?",
      "hint": "A scholar and confidant, I stand watch when others sleep.",
      "answer": "Horatio",
      "difficulty": 3
    },
    {
      "riddle": "I am the woman who drowns, surrounded by flowers and sorrow. Who am I?",
      "hint": "My end is as poetic as the garlands I weave.",
      "answer": "Ophelia",
      "difficulty": 4
    },
    {
      "riddle": "I am the play within the play, staged to catch a conscience. What am I called?",
      "hint": "My title evokes a device for trapping the smallest of creatures.",
      "answer": "The Mousetrap",
      "difficulty": 5
    },
    {
      "riddle": "I am the man who gives advice to his son, but am often mocked for my long-winded speeches. Who am I?",
      "hint": "My words are many, but my wisdom is sometimes questioned.",
      "answer": "Polonius",
      "difficulty": 3
    },
    {
      "riddle": "I am the phrase Hamlet utters as he contemplates action versus inaction, pondering existence itself. What is the phrase?",
      "hint": "I begin with a choice between presence and absence.",
      "answer": "To be, or not to be",
      "difficulty": 2
    },
    {
      "riddle": "I am the country Hamlet is sent to, with a letter meant to seal his fate. What country am I?",
      "hint": "Across the sea, this land is ruled by a queen.",
      "answer": "England",
      "difficulty": 4
    },
    {
      "riddle": "I am the king’s loyal servant, disguised to serve after being banished. Who am I?",
      "hint": "Loyalty leads me to wear another’s face.",
      "answer": "Kent",
      "difficulty": 5
    },
    {
      "riddle": "I am the cruelest of Lear’s daughters, married to the Duke of Cornwall. Who am I?",
      "hint": "I am neither the eldest nor the youngest, but my heart is coldest.",
      "answer": "Regan",
      "difficulty": 6
    },
    {
      "riddle": "I am the wise fool who tells Lear the truth, even when others won’t. Who am I?",
      "hint": "My cap jingles, but my words cut deep.",
      "answer": "The Fool",
      "difficulty": 3
    },
    {
      "riddle": "I am the son who is tricked into fleeing by his illegitimate brother. Who am I?",
      "hint": "I wander as a madman, hiding behind rags and riddles.",
      "answer": "Edgar",
      "difficulty": 5
    },
    {
      "riddle": "I am the storm that rages as Lear loses his mind. What am I a metaphor for?",
      "hint": "I rage without thunder, reflecting a shattered mind.",
      "answer": "Lear's madness",
      "difficulty": 7
    },
    {
      "riddle": "I am the daughter who says, “I cannot heave my heart into my mouth.” Who am I?",
      "hint": "My silence speaks the loudest love.",
      "answer": "Cordelia",
      "difficulty": 4
    },
    {
      "riddle": "I am the prince who orchestrates matchmaking and mischief. Who am I?",
      "hint": "I lead with charm and command, but my brother walks a darker path.",
      "answer": "Don Pedro",
      "difficulty": 4
    },
    {
      "riddle": "I am the villain whose schemes nearly ruin Hero’s happiness. Who am I?",
      "hint": "My motives are as shadowy as my parentage.",
      "answer": "Don John",
      "difficulty": 3
    },
    {
      "riddle": "I am the constable, known for my malapropisms and comic confusion. Who am I?",
      "hint": "My words are as tangled as the bushes that share my name.",
      "answer": "Dogberry",
      "difficulty": 5
    },
    {
      "riddle": "I am the woman falsely accused at the altar, thought dead before being revealed alive. Who am I?",
      "hint": "My name is a promise, and my patience is tested.",
      "answer": "Hero",
      "difficulty": 4
    },
    {
      "riddle": "I am the witty man who claims he will die a bachelor, but is tricked into love. Who am I?",
      "hint": "My tongue is sharp, but my heart is softer than I admit.",
      "answer": "Benedick",
      "difficulty": 3
    },
    {
      "riddle": "I am the masked event where mistaken identities and secret conversations abound. What am I?",
      "hint": "Disguises and secrets swirl beneath the music and candlelight.",
      "answer": "Masquerade",
      "difficulty": 6
    },
    {
      "riddle": "I am the phrase Beatrice uses to describe Benedick’s change of heart, referencing a “miracle.” What does she call it?",
      "hint": "A single word of wonder, uttered when the impossible becomes real.",
      "answer": "Miracle",
      "difficulty": 7
    }
  ]
  